Autodesk.Revit.DB.Analysis.GenericZone.RemoveSpaces(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Removes spaces from the zone.
spaceIds:
The spaces to be removed from the zone. The spaces that are not in the zone will be ignored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This generic zone must be space-based.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.AddSpaces(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Adds spaces to the zone.
spaceIds:
The spaces to be added to the zone. The spaces that are already in the zone will be ignored.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementIdSet spaceIds must be all MEP Spaces, and associated with the same level as the zone element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This generic zone must be space-based.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.GetSpaceIds
Gets a list of ElementIds of the associated spaces for the zone.
Returns:
The associated spaces for the space-based zone.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This generic zone must be space-based.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.GetSketchId
Gets the sketch id for the generic zone.
Returns:
The sketch element id for the sketch-based generic zone.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This generic zone must be sketch-based.
Since:
2020.1

Autodesk.Revit.DB.Analysis.GenericZone.ConvertSpaceBasedToSketchBased(Autodesk.Revit.DB.ElementId)
Converts a space-based generic zone to a sketch-based generic zone.
Remarks:
This element must be the space-based before the conversion. The conversation will keep the
same element id, name, but swapped into a different type as specified.
typeId:
The sketch-based element type for the new generic zone.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element typeId is not a valid sketch-based zone type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing this GenericZone is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The element is a member of a loaded family.
-or-
The element is a member of a group type that is
not being edited.
-or-
This generic zone must be space-based.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this GenericZone is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this GenericZone is being loaded, or is in the midst of another
sensitive process.
-or-
This GenericZone is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this GenericZone is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This GenericZone is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this GenericZone has no open transaction.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.CreateSpaceBased(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,Autodesk.Revit.DB.Analysis.GenericZoneDomainData,Autodesk.Revit.DB.ElementId,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Creates a new instance of a generic zone using a set of spaces and adds it to the document.
doc:
The document where the element will be created and added.
typeId:
The space-based element type for the new generic zone.
name:
The name of the generic zone to be created.
domainData:
The specific domain requirements for the generic zone.
levelId:
The base level on which the generic zone will be created.
spaceIds:
The associated spaces for the zone.
Returns:
The newly created generic zone.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element type is not a valid space-based type for this generic zone.
-or-
name is an empty string.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The ElementId levelId is not a Level.
-or-
The ElementIdSet spaceIds must be all MEP Spaces, and associated with the same level as levelId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.CreateSketchBased(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,Autodesk.Revit.DB.Analysis.GenericZoneDomainData,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a new instance of a sketch-based generic zone and adds it to the document.
doc:
The document where the element will be created and added.
typeId:
The sketch-based element type for the new generic zone.
name:
The name of the generic zone to be created.
domainData:
The specific domain requirements for the generic zone.
levelId:
The base level on which the generic zone will be created.
curveLoops:
The loops that define the lines, curves and areas that overlap or crosses the elements you want to belong to the zone.
Multiple loops are allowed, they can be open or closed, but they should be on the same horizontal plane.
Returns:
The newly created generic zone.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element type is not a valid sketch-based type for this generic zone.
-or-
name is an empty string.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The ElementId levelId is not a Level.
-or-
The curve loops in the input array are empty.
-or-
The input curve loops do not all lie in the same horizontal plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.Perimeter
The perimeter for the zone, in feet.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.OccupiedVolume
The occupied volume for the zone, in cubic feet.
Remarks:
The occupied volume of a space-based zone is the sum of the volumes of the spaces marked Occupiable in the zone.
This property will return a value of zero for zones where this type of volume isn't applicable.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.Volume
The volume for the zone, in cubic feet.
Remarks:
The volume (the gross volume) of a space-based zone is the sum of the volumes of all spaces in the zone.
This property will return a value of zero for zones when the volume isn't defined.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.OccupiedArea
The occupied area for the zone, in square feet.
Remarks:
The occupied area of a space-based zone is the sum of the areas of the spaces marked Occupiable in the zone.
This property will return a value of zero for zones where this type of area isn't applicable.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.Area
The area for the zone, in square feet.
Remarks:
The area (the gross area) of a space-based zone is the sum of the areas of all spaces in the zone.
Since:
2026

Autodesk.Revit.DB.Analysis.GenericZone.GeometricDefinition
The geometric definition for this generic zone.
Since:
2026